from colorama import init, Fore, Back, Style

# init() - цей метод ініціалізує бібліотеку Colorama. Викликайте його на початку своєї програми, щоб підготувати консоль до використання кольорів.
# Fore - це клас, який містить атрибути для зміни кольору тексту переднього плану (foreground). Наприклад, Fore.RED змінює колір тексту на червоний.
# Back - цей клас містить атрибути для зміни кольору фону тексту. Наприклад, Back.GREEN змінює колір фону на зелений.
# Style - цей клас містить атрибути для зміни стилю тексту. Наприклад, Style.BOLD робить текст жирним.
# Fore.RESET - цей атрибут повертає колір тексту до значення за замовчуванням.
# Back.RESET - цей атрибут повертає колір фону тексту до значення за замовчуванням.
# Style.RESET_ALL - цей атрибут скидає всі зміни стилю тексту до значень за замовчуванням.

init()
print(Fore.RED + Back.GREEN + "Цей текст червоного кольору на зеленому фоні" + Style.RESET_ALL)
